-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- 호스트: infodb.ansan.ac.kr
-- 생성 시간: 25-12-03 01:04
-- 서버 버전: 12.0.2-MariaDB
-- PHP 버전: 8.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `db2251002`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `themes`
--

CREATE TABLE `themes` (
  `id` int(11) NOT NULL,
  `user_id` varchar(100) DEFAULT NULL,
  `title` varchar(100) NOT NULL,
  `words` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`words`)),
  `creator` varchar(50) DEFAULT '익명',
  `created_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 테이블의 덤프 데이터 `themes`
--

INSERT INTO `themes` (`id`, `user_id`, `title`, `words`, `creator`, `created_at`) VALUES
(1, NULL, '🍎 알록달록 과일 나라', '[\"사과\", \"배\", \"포도\", \"수박\", \"딸기\", \"바나나\", \"망고\", \"키위\", \"파인애플\", \"복숭아\", \"자두\", \"살구\", \"감\", \"귤\", \"오렌지\", \"레몬\", \"라임\", \"체리\", \"멜론\", \"참외\", \"석류\", \"자몽\", \"블루베리\", \"산딸기\", \"코코넛\", \"아보카도\", \"리치\", \"망고스틴\", \"두리안\", \"용과\", \"무화과\", \"유자\", \"한라봉\", \"천혜향\", \"샤인머스캣\", \"거봉\", \"청포도\", \"앵두\", \"모과\", \"대추\", \"매실\", \"오디\", \"복분자\", \"크랜베리\", \"라즈베리\", \"블랙베리\", \"패션후르츠\", \"파파야\", \"구아바\", \"스타후르츠\"]', 'System', '2025-12-02 15:01:22'),
(2, NULL, '🐶 동물의 왕국', '[\"사자\", \"호랑이\", \"곰\", \"여우\", \"늑대\", \"강아지\", \"고양이\", \"토끼\", \"햄스터\", \"기린\", \"코끼리\", \"원숭이\", \"고릴라\", \"캥거루\", \"코알라\", \"판다\", \"얼룩말\", \"하마\", \"악어\", \"펭귄\", \"독수리\", \"참새\", \"비둘기\", \"오리\", \"닭\", \"타조\", \"공작\", \"앵무새\", \"돌고래\", \"고래\", \"상어\", \"물개\", \"수달\", \"해달\", \"다람쥐\", \"청설모\", \"고슴도치\", \"두더지\", \"박쥐\", \"뱀\", \"거북이\", \"개구리\", \"도마뱀\", \"카멜레온\", \"이구아나\", \"미어캣\", \"라쿤\", \"알파카\", \"양\", \"염소\"]', 'System', '2025-12-02 15:01:22'),
(3, NULL, '✈️ 세계 여행 빙고', '[\"대한민국\", \"미국\", \"일본\", \"중국\", \"영국\", \"프랑스\", \"독일\", \"이탈리아\", \"스페인\", \"포르투갈\", \"브라질\", \"아르헨티나\", \"캐나다\", \"호주\", \"뉴질랜드\", \"인도\", \"러시아\", \"멕시코\", \"베트남\", \"태국\", \"이집트\", \"남아공\", \"튀르키예\", \"그리스\", \"스위스\", \"네덜란드\", \"벨기에\", \"스웨덴\", \"핀란드\", \"노르웨이\", \"덴마크\", \"폴란드\", \"헝가리\", \"체코\", \"오스트리아\", \"아일랜드\", \"우크라이나\", \"사우디아라비아\", \"이란\", \"이라크\", \"이스라엘\", \"인도네시아\", \"말레이시아\", \"싱가포르\", \"필리핀\", \"대만\", \"몽골\", \"칠레\", \"콜롬비아\", \"페루\"]', 'System', '2025-12-02 15:01:22'),
(4, NULL, '🍜 한국인의 소울푸드 라면', '[\"신라면\", \"진라면\", \"너구리\", \"짜파게티\", \"안성탕면\", \"삼양라면\", \"팔도비빔면\", \"불닭볶음면\", \"육개장사발면\", \"참깨라면\", \"오징어짬뽕\", \"튀김우동\", \"새우탕\", \"틈새라면\", \"무파마\", \"감자면\", \"스낵면\", \"열라면\", \"진짬뽕\", \"짜왕\", \"왕뚜껑\", \"꼬꼬면\", \"나가사끼짬뽕\", \"맛있는라면\", \"신라면블랙\", \"짜짜로니\", \"간짬뽕\", \"사리곰탕면\", \"된장라면\", \"기스면\", \"남자라면\", \"앵그리너구리\", \"까르보불닭\", \"치즈불닭\", \"짜파구리\", \"멸치칼국수\", \"비빔면\", \"메밀소바\", \"둥지냉면\", \"찰비빔면\", \"진짜장\", \"진진짜라\", \"오동통면\", \"부대찌개면\", \"김치사발면\", \"컵누들\", \"미역국라면\", \"북어국라면\", \"쌀국수\", \"도시락\"]', 'System', '2025-12-02 15:01:22'),
(5, NULL, '🐭 포켓몬스터 1세대 (근본)', '[\"피카츄\", \"라이츄\", \"파이리\", \"리자몽\", \"꼬부기\", \"거북왕\", \"이상해씨\", \"이상해꽃\", \"버터플\", \"피죤투\", \"푸린\", \"나옹\", \"고라파덕\", \"잠만보\", \"이브이\", \"샤미드\", \"쥬피썬더\", \"부스터\", \"뮤츠\", \"뮤\", \"망나뇽\", \"팬텀\", \"갸라도스\", \"잉어킹\", \"라프라스\", \"알통몬\", \"괴력몬\", \"꼬마돌\", \"롱스톤\", \"디그다\", \"닥트리오\", \"야돈\", \"야도란\", \"코일\", \"파오리\", \"질퍽이\", \"셀러\", \"고오스\", \"슬리프\", \"크랩\", \"찌리리공\", \"아라리\", \"탕구리\", \"내루미\", \"또가스\", \"뿔카노\", \"럭키\", \"캥카\", \"쏘드라\", \"별가사리\"]', 'System', '2025-12-02 15:01:22');

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `themes`
--
ALTER TABLE `themes`
  ADD PRIMARY KEY (`id`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `themes`
--
ALTER TABLE `themes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
